/***************************************************************************
 *                  Драйвер матричной клавиатуры 2x4
 *                                v 1.0
 *                  Copyright (c) Кизим Игорь aka Igoryosha
 *                        Website : lobotryasy.net 
 *
 *		    i.rau cделал это для STM32	
 *			boxeur@mail.ru
 ***************************************************************************/
#ifndef	__KEYB_h
#define	__KEYB_h

#include "main.h"


/****************************************************************
 *           ПРОТОТИПЫ ФУНКЦИЙ
 ****************************************************************/

/**
 * Инициализация клавиатуры 
 */
void KeypadInit(void);

/**
 *     Получение кода нажатой кнопки
 *     Запускать функцию в основном цикле
 */
char KeypadRead(void);

/**
 * Функция сканирования клавиатуры (запускается в прерывании таймера)
 *      Функция работает в прерывании таймера!
 */
void KeypadScan(void);


#endif				/* __KEYB_h */
