#ifndef __I2C1_H
#define __I2C1_H


//--------------------------------------------------------------
// Includes
//--------------------------------------------------------------
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_i2c.h"
#include "stm32f4xx.h"
#include "main.h"



//--------------------------------------------------------------
// Многобайтовое определение
//--------------------------------------------------------------
#define    I2C1_MULTIBYTE_ANZ   10	/* число байтов */




//--------------------------------------------------------------
// I2C-Clock
// Основная частота (I2C1)= APB1 (APB1=42MHz)
// Настройка = 100000 = 100 kHz
//--------------------------------------------------------------
#define   I2C1_CLOCK_FRQ   100000	// I2C-частота в Hz (100 kHz)


//--------------------------------------------------------------
// Определения
//-------------------------------------------------------------- 
#define   I2C1_TIMEOUT     0x3000	// Время тайм-аута



//--------------------------------------------------------------
// Структуры выводов I2C
//--------------------------------------------------------------
typedef struct {
    GPIO_TypeDef *PORT;		// Port
    const u16 PIN;		// Pin
    const u32 CLK;		// Clock
    const u8 SOURCE;	// Source
} I2C1_PIN_t;


//--------------------------------------------------------------
// Структура устройства I2C
//--------------------------------------------------------------
typedef struct {
    I2C1_PIN_t SCL;		// Clock-Pin
    I2C1_PIN_t SDA;		// Data-Pin
} I2C1_DEV_t;




//--------------------------------------------------------------
// глобальная функция
//--------------------------------------------------------------
void ub_i2c1_init(void);
s16 ub_i2c1_read_byte(u8, u8);
s16 ub_i2c1_write_byte(u8, u8, u8);
s16 ub_i2c1_read_many_bytes(u8 , u8 , u8 );
s16 ub_i2c1_simple_read_byte(u8);
s16 ub_i2c1_write_many_bytes(u8, u8, u8);
s16 ub_i2c1_simple_write_byte(u8 , u8);
void ub_i2c1_delay(volatile u32);

//--------------------------------------------------------------
#endif				// __I2C1_H
